[
  {
    "id": "1",
    "name": "Vimdesk ERP system",
    "img": "vimdesk.png",
    "description": "Vimdesk is an ERP system that I had the opportunity to work on during my internship at COTIT. My primary focus was on the front-end development, utilizing Vue 3 to create user-friendly interfaces that enhanced the overall user experience. This experience allowed me to refine my skills in building dynamic and responsive web applications, while ensuring the design and functionality met the system's requirements. Additionally, I gained exposure to the back-end by contributing to the development of the API, which was built using Laravel. This aspect of my work gave me a deeper understanding of how front-end and back-end components interact, as well as insight into designing efficient and scalable APIs. Working on Vimdesk not only honed my technical abilities but also gave me valuable experience in collaborating within a team to deliver a robust ERP solution.",
    "url": "https://app.vimdesk.io"
  },
  {
    "id": "2",
    "name": "TBB Express Portal",
    "img": "tbb.png",
    "description": "TBB Express is my current employer, where I have been fortunate to grow both professionally and personally. TBB operates a robust transporter system, which is built using modern technologies such as Vue 3 for the front-end and Laravel for the back-end. I initially joined the company as a front-end developer, focusing on creating intuitive and responsive user interfaces. Over time, I had opportunities to contribute to the back-end as well, allowing me to broaden my technical expertise and gain valuable experience in server-side development. Through hard work and dedication, I was eventually promoted to a full-stack developer role, where I now handle end-to-end development responsibilities, ensuring seamless integration between the front-end and back-end systems. Additionally, I was entrusted with the role of internship supervisor, mentoring and guiding new interns as they navigate their early career paths, which has been a rewarding experience in leadership and collaboration.",
    "url": "https://portal.tbbexpress.com"
  }
]